In [1]:
from datetime import datetime
import pandas as pd
%matplotlib inline
import matplotlib.pyplot as pyplot

In [2]:
#In this step we are simply creating a dataframe with dates on battle deaths taken from a online game. 

data = {'date': ['2014-05-01 18:47:05.069722', '2014-05-01 18:47:05.119994', '2014-05-02 18:47:05.178768', '2014-05-02 18:47:05.230071', '2014-05-02 18:47:05.230071', '2014-05-02 18:47:05.280592', '2014-05-03 18:47:05.332662', '2014-05-03 18:47:05.385109', '2014-05-04 18:47:05.436523', '2014-05-04 18:47:05.486877'], 
        'battle_deaths': [34, 25, 26, 15, 15, 14, 26, 25, 62, 41]}
df = pd.DataFrame(data, columns = ['date', 'battle_deaths'])
print(df)

                         date  battle_deaths
0  2014-05-01 18:47:05.069722             34
1  2014-05-01 18:47:05.119994             25
2  2014-05-02 18:47:05.178768             26
3  2014-05-02 18:47:05.230071             15
4  2014-05-02 18:47:05.230071             15
5  2014-05-02 18:47:05.280592             14
6  2014-05-03 18:47:05.332662             26
7  2014-05-03 18:47:05.385109             25
8  2014-05-04 18:47:05.436523             62
9  2014-05-04 18:47:05.486877             41

In [3]:
#In this step let's convert our date column to a datetime data type. 

df['date'] = pd.to_datetime(df['date'])

In [9]:
df['date'].dtypes

dtype('<M8[ns]')

In [10]:
#In this step we are setting the date column as our index and removing that column. 

df.index = df['date']
del df['date']
df

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [11]:
#In this step we are viewing all the observations(rows) that happened in 2014. 

df['2014']

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [12]:
#In this step we are viewing all the deaths in happened in May of 2014. 

df['2014-05']

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [13]:
#In this step we are viewing all deaths that happened after May 3, 2014. 

df[datetime(2014, 5, 3):]

                            battle_deaths
date
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [14]:
#In this step we are viewing observations the happened between May 3 and May 4 of 2014. 

df['5/3/2014':'5/4/2014']

                            battle_deaths
date
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [15]:
#In this step let's remove or truncate all rows after May 2, 2014. 

df.truncate(after='5/3/2014')

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14

In [18]:
#In this step we are using a different approach, the .loc method to view all rows in May of 2014. 

df.loc['2014-5-2']

                            battle_deaths
date
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14

# DateOffset

In [19]:
#We are retrieving all the business days between the two dates specified, inclusive of the dates specified. 
dti = pd.date_range('2018-07-22', '2018-08-01', freq='B')   
dti.values

array(['2018-07-23T00:00:00.000000000', '2018-07-24T00:00:00.000000000',
       '2018-07-25T00:00:00.000000000', '2018-07-26T00:00:00.000000000',
       '2018-07-27T00:00:00.000000000', '2018-07-30T00:00:00.000000000',
       '2018-07-31T00:00:00.000000000', '2018-08-01T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [20]:
#This code simply checks the frequency of our dataframe. 
dti.freq

In [21]:
#In this step we are importing the data offset types. Then, we are calculating one business day from 2014-8-31.
days = pd.date_range('2018-07-22', '2018-08-15', freq='B')   
for d in days : print (d)
from pandas.tseries.offsets import *
d + BusinessDay()

2018-07-23 00:00:00
2018-07-24 00:00:00
2018-07-25 00:00:00
2018-07-26 00:00:00
2018-07-27 00:00:00
2018-07-30 00:00:00
2018-07-31 00:00:00
2018-08-01 00:00:00
2018-08-02 00:00:00
2018-08-03 00:00:00
2018-08-06 00:00:00
2018-08-07 00:00:00
2018-08-08 00:00:00
2018-08-09 00:00:00
2018-08-10 00:00:00
2018-08-13 00:00:00
2018-08-14 00:00:00
2018-08-15 00:00:00

Timestamp('2018-08-16 00:00:00')

In [22]:
d + 5 * BusinessDay()

Timestamp('2018-08-22 00:00:00')

In [23]:
#This step uses the BMonthEnd object to calculate the last business day of a month from a given date
d + BMonthEnd()

Timestamp('2018-08-31 00:00:00')

In [24]:
#In this step we are using the rollforward method to calculate the month end of the date we passed to it.
from datetime import datetime
BMonthEnd().rollforward(datetime(2018, 7, 22))

Timestamp('2018-07-31 00:00:00')

In [26]:
d

Timestamp('2018-08-15 00:00:00', freq='B')

In [25]:
#In this step several of the offset classes can be parameterized to provide finer control of the offset behavior. 
#This step calculates the date of the Tuesday (weekday = 1) in the week prior.
d - Week(weekday = 1)

Timestamp('2018-08-14 00:00:00')

# PERIOD

In [29]:
jul2018 = pd.Period('2018-07',freq='M')

In [30]:
jul2018.start_time

Timestamp('2018-07-01 00:00:00')

In [31]:
jul2018.end_time

Timestamp('2018-07-31 23:59:59.999999999')

In [33]:
aug2018 = jul2018 + 1

In [34]:
aug2018

Period('2018-08', 'M')